In [2]:
import numpy as np
import pandas as pd

from datetime import datetime

In [3]:
year = 2025
month = 2
day = 21
hour = 22
min = 33
sec = 34

In [4]:
date = datetime(year, month, day)

In [5]:
date

datetime.datetime(2025, 2, 21, 0, 0)

In [6]:
datetime = datetime(year, month, day, hour, min, sec)

In [7]:
datetime

datetime.datetime(2025, 2, 21, 22, 33, 34)

In [8]:
datetime.year

2025

In [9]:
ser = pd.Series(['Nov 3, 1990', '2000-01-01', None])

In [10]:
ser

0    Nov 3, 1990
1     2000-01-01
2           None
dtype: object

In [14]:
ser

0    Nov 3, 1990
1     2000-01-01
2           None
dtype: object

In [17]:
time_of_ser = pd.to_datetime(ser, format='mixed')

In [18]:
time_of_ser

0   1990-11-03
1   2000-01-01
2          NaT
dtype: datetime64[ns]

In [19]:
time_of_ser[0].year

1990

In [20]:
euro_date = '10-12-2000'

In [21]:
pd.to_datetime(euro_date, dayfirst=True)

Timestamp('2000-12-10 00:00:00')

In [22]:
style_date = '12--Dec--2000'

In [26]:
pd.to_datetime(style_date, format='%d--%b--%Y')

Timestamp('2000-12-12 00:00:00')

In [27]:
custom_date = '12th of Dec 2000'

In [28]:
pd.to_datetime(custom_date)

Timestamp('2000-12-12 00:00:00')

In [39]:
data = pd.read_csv("C:\\Users\\ply58\\PythonML\\UNZIP_FOR_NOTEBOOKS_FINAL\\03-Pandas\\RetailSales_BeerWineLiquor.csv")

In [40]:
data

           DATE  MRTSSM4453USN
0    1992-01-01           1509
1    1992-02-01           1541
2    1992-03-01           1597
3    1992-04-01           1675
4    1992-05-01           1822
..          ...            ...
335  2019-12-01           6630
336  2020-01-01           4388
337  2020-02-01           4533
338  2020-03-01           5562
339  2020-04-01           5207

[340 rows x 2 columns]

In [41]:
data['DATE'] = pd.to_datetime(data['DATE'])

In [42]:
data

          DATE  MRTSSM4453USN
0   1992-01-01           1509
1   1992-02-01           1541
2   1992-03-01           1597
3   1992-04-01           1675
4   1992-05-01           1822
..         ...            ...
335 2019-12-01           6630
336 2020-01-01           4388
337 2020-02-01           4533
338 2020-03-01           5562
339 2020-04-01           5207

[340 rows x 2 columns]

In [44]:
data['DATE'][0].year

1992

In [55]:
data1 = pd.read_csv("C:\\Users\\ply58\\PythonML\\UNZIP_FOR_NOTEBOOKS_FINAL\\03-Pandas\\RetailSales_BeerWineLiquor.csv", parse_dates=[0])

In [57]:
data1

          DATE  MRTSSM4453USN
0   1992-01-01           1509
1   1992-02-01           1541
2   1992-03-01           1597
3   1992-04-01           1675
4   1992-05-01           1822
..         ...            ...
335 2019-12-01           6630
336 2020-01-01           4388
337 2020-02-01           4533
338 2020-03-01           5562
339 2020-04-01           5207

[340 rows x 2 columns]

In [58]:
data1 = data1.set_index('DATE')

In [59]:
data1.resample('M').mean()

C:\Users\ply58\AppData\Local\Temp\ipykernel_22656\947067014.py:1: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  data1.resample('M').mean()

            MRTSSM4453USN
DATE
1992-01-31         1509.0
1992-02-29         1541.0
1992-03-31         1597.0
1992-04-30         1675.0
1992-05-31         1822.0
...                   ...
2019-12-31         6630.0
2020-01-31         4388.0
2020-02-29         4533.0
2020-03-31         5562.0
2020-04-30         5207.0

[340 rows x 1 columns]